module.exports = {
  root: true,
  env: {
    browser: true,
    node: true,
    es6: true
  },
  extends: ['plugin:vue/essential', 'eslint:recommended'],
  parserOptions: {
    parser: 'babel-eslint',
    sourceType: 'module', // script or module
    ecmaFeatures: {
      jsx: true // 启用 jsx语法
    }
  },
  plugins: [],
  rules: {
    /********************************start javascript 逻辑相关设置********************************/
    'getter-return': 2, // ---------------------------------强制 getter 函数中出现 return 语句
    'no-cond-assign': [2, 'always'], // --------------------禁止条件表达式中出现赋值操作符
    'no-console':
      process.env.NODE_ENV === 'production'
        ? [
            1,
            {
              allow: ['warn', 'error']
            }
          ]
        : 0,
    'no-debugger': process.env.NODE_ENV === 'production' ? 1 : 0,
    'no-async-promise-executor': 2, // ---------------------禁止使用异步函数作为 Promise executor
    'no-control-regex': 2, // ------------------------------禁止在正则表达式中使用控制字符
    'no-empty-character-class': 2, // ----------------------禁止在正则表达式中使用空字符集
    'no-obj-calls': 2, // ----------------------------------禁止将全局对象当作函数进行调用
    'no-prototype-builtins': 1, // -------------------------禁止直接使用 Object.prototypes 的内置属性
    'no-irregular-whitespace': 2, // -----------------------禁止不规则的空白
    'no-template-curly-in-string': 2, // -------------------禁止在常规字符串中出现模板字面量占位符语法
    'no-unexpected-multiline': 1, // -----------------------禁止出现令人困惑的多行表达式
    'no-await-in-loop': 2, // ------------------------------禁止在循环中 出现 await
    'no-compare-neg-zero': 2, // ---------------------------禁止与 -0 进行比较
    'no-constant-condition': 2, // -------------------------禁止在条件中使用常量表达式
    'no-dupe-args': 2, // ----------------------------------禁止 function 定义中出现重名参数
    'no-dupe-keys': 2, // ----------------------------------禁止对象字面量中出现重复的 key
    'no-duplicate-case': 2, // -----------------------------禁止出现重复的 case 标签
    'no-empty': 2, // --------------------------------------禁止出现空语句块
    'no-ex-assign': 2, // ----------------------------------禁止对 catch 子句的参数重新赋值
    'no-extra-boolean-cast': 1, // -------------------------禁止不必要的布尔转换
    'no-extra-parens': 1, // -------------------------------禁止不必要的括号
    'no-extra-semi': 2, // ---------------------------------禁止不必要的分号
    'no-func-assign': 2, // --------------------------------禁止对 function 声明重新赋值
    'no-invalid-regexp': 2, // -----------------------------禁止 RegExp 构造函数中存在无效的正则表达式字符串
    'no-inner-declarations': 1, // -------------------------禁止在嵌套的块中出现变量声明或 function 声明
    'no-regex-spaces': 1, // -------------------------------禁止正则表达式字面量中出现多个空格
    'no-sparse-arrays': 2, // ------------------------------禁用稀疏数组
    'no-unreachable': 2, // --------------------------------禁止在 return、throw、continue 和 break 语句之后出现不可达代码
    'no-unsafe-finally': 2, // -----------------------------禁止在 finally 语句块中出现控制流语句
    'no-unsafe-negation': 2, // ----------------------------禁止对关系运算符的左操作数使用否定操作符
    'require-atomic-updates': 2, // ------------------------禁止由于 await 或 yield的使用而可能导致出现竞态条件的赋值
    'use-isnan': 2, // -------------------------------------要求使用 isNaN() 检查 NaN
    'valid-typeof': 2, // ----------------------------------强制 typeof 表达式与有效的字符串进行比较
    /********************************end javascript 逻辑相关设置********************************/

    /********************************start ES6 相关设置********************************/
    'arrow-body-style': [1, 'as-needed'], // ---------------要求箭头函数体使用大括号 当大括号是可以省略的，强制不使用它们
    'arrow-spacing': [
      // ----------------------------------强制箭头函数的箭头前后使用一致的空格
      2,
      {
        before: true,
        after: true
      }
    ],
    'generator-star-spacing': [
      // -------------------------强制 generator 函数中 * 号周围使用一致的空格
      2,
      {
        before: false,
        after: true
      }
    ],
    'no-const-assign': 2, // -------------------------------禁止修改 const 声明的变量
    'no-dupe-class-members': 2, // -------------------------禁止类成员中出现重复的名称
    'no-duplicate-imports': 2, // --------------------------禁止重复模块导入
    'no-new-symbol': 2, // ---------------------------------禁止 Symbolnew 操作符和 new 一起使用
    'no-this-before-super': 2, // --------------------------禁止在构造函数中，在调用 super() 之前使用 this 或 super
    'no-useless-computed-key': 2, // -----------------------禁止在对象中使用不必要的计算属性
    'no-useless-rename': [
      // ------------------------------禁止在 import 和 export 将引用重命名为相同的名字
      2,
      {
        ignoreDestructuring: true, // --------------------不检查解构赋值
        ignoreImport: false,
        ignoreExport: false
      }
    ],
    'no-var': 2, // ----------------------------------------要求使用 let 或 const 而不是 var
    'object-shorthand': [1, 'methods'], // -----------------要求或禁止对象字面量中方法和属性使用简写语法
    'prefer-const': 1, // ----------------------------------要求使用 const 声明那些声明后不再被修改的变量
    'prefer-template': 1, // -------------------------------要求使用模板字面量而非字符串连接
    'require-yield': 2, // ---------------------------------要求 generator 函数内有 yield
    'rest-spread-spacing': [2, 'never'], // ----------------强制剩余和扩展运算符及其表达式之间有空格
    'symbol-description': 1, // ----------------------------要求 symbol 描述
    'template-curly-spacing': [2, 'never'], // -------------要求或禁止模板字符串中的嵌入表达式周围空格的使用
    'yield-star-spacing': [2, 'after'], // -----------------强制在 yield* 表达式中 * 周围使用空格
    /********************************end ES6 相关设置********************************/

    /********************************start 风格 相关设置********************************/
    'array-bracket-newline': [2, 'consistent'], // ---------在数组开括号后和闭括号前强制换行
    'array-bracket-spacing': [
      // --------------------------强制数组方括号中使用一致的空格
      2,
      'never',
      {
        singleValue: false, // ---------------------------禁止在只包含一个元素的数组的括号内使用空格
        objectsInArrays: false, // -----------------------禁止在数组的方括号和数组内的对象元素的大括号之间，即 [{ 或 }]出现空格
        arraysInArrays: false // -------------------------禁止在数组的方括号和数组内的数组元素的方括号之间，即 [[ 或 ]]出现空格
      }
    ],
    'array-element-newline': [2, 'consistent'], // ---------强制数组元素间出现换行
    'block-spacing': [2, 'never'], // ----------------------禁止或强制在代码块中开括号前和闭括号后有空格
    'brace-style': [2, '1tbs'], // -------------------------强制在代码块中使用一致的大括号风格
    'comma-dangle': [2, 'never'], // -----------------------要求或禁止使用拖尾逗号
    'comma-spacing': [
      // ----------------------------------强制在逗号周围使用空格
      2,
      {
        before: false, // --------------------------------逗号之前禁止空格
        after: true // -----------------------------------逗号之后必须有空格
      }
    ],
    'comma-style': [2, 'last'], // -------------------------要求逗号放在数组元素、对象属性或变量声明之后，且在同一行
    'computed-property-spacing': [2, 'never'], // ----------禁止或强制在计算属性中使用空格
    'consistent-this': [2, 'self'], // ---------------------this指定别名统一使用self
    'func-call-spacing': [2, 'never'], // ------------------要求或禁止在函数标识符和其调用之间有空格
    'function-paren-newline': [2, 'multiline'], // ---------强制在函数括号内使用一致的换行
    'implicit-arrow-linebreak': [2, 'beside'], // ----------强制隐式返回的箭头函数体的位置
    indent: [2, 2], // -----------------------------------强制使用一致的缩进
    'jsx-quotes': [2, 'prefer-single'], // -----------------强制所有不包含单引号的 JSX 属性值使用单引号
    'key-spacing': [
      // -------------------------------------------------强制在对象字面量的键和值之间使用一致的空格
      2,
      {
        beforeColon: false, // ---------------------------禁止在对象字面量的键和冒号之间存在空格
        afterColon: true // ------------------------------要求在对象字面量的冒号和值之间存在至少有一个空格
      }
    ],
    'keyword-spacing': [
      // -------------------------------------------------强制关键字周围空格的一致性
      2,
      {
        before: true, // ---------------------------------要求在关键字之前至少有一个空格
        after: true // -----------------------------------要求在关键字之后至少有一个空格
      }
    ],
    'max-depth': [2, 4], // --------------------------------强制块语句的最大可嵌套深度
    'max-nested-callbacks': 0, // ---------------------强制回调函数最大嵌套深度
    'max-params': [2, 6], // -------------------------------限制函数定义中最大参数个数
    'newline-per-chained-call': [
      // ---------------------------------------------------要求方法链中每个调用都有一个换行符
      2,
      {
        ignoreChainWithDepth: 2
      }
    ],
    'no-array-constructor': 2, // --------------------------禁止使用 Array 构造函数
    'no-continue': 2, // -----------------------------------禁用 continue
    'no-lonely-if': 2, // ----------------------------------禁止 if 语句作为唯一语句出现在 else 语句块中
    'no-mixed-operators': 0, // ----------------------------禁止混合使用不同的操作符
    'no-multi-assign': 2, // -------------------------------禁止连续赋值
    'no-unneeded-ternary': 1, // ---------------------------禁止可以表达为更简单结构的三元操作符
    'no-whitespace-before-property': 2, // -----------------禁止属性前有空白
    'object-curly-newline': [2, {consistent: true}], // ----强制在花括号内使用一致的换行符
    'object-curly-spacing': [2, 'never'], // ---------------不允许花括号中有空格
    'object-property-newline': 2, // -----------------------强制将对象的属性放在不同的行上
    'one-var': [2, 'never'], // ----------------------------强制函数中的变量分开声明
    'quote-props': [1, 'as-needed'], // --------------------当没有严格要求时，禁止对象字面量属性名称使用引号
    quotes: [
      // ---------------------------------------------------强制使用一致的反勾号、双引号或单引号
      1,
      'single', // -----------------------------------------要求尽可能地使用单引号
      {
        allowTemplateLiterals: true // ---------------------允许字符串使用反勾号
      }
    ],
    semi: [2, 'always'], // --------------------------------要求在语句末尾使用分号
    'semi-spacing': [
      // -----------------------------------强制分号前后无空格
      2,
      {
        before: false,
        after: false
      }
    ],
    'semi-style': [2, 'last'], // --------------------------强制分号出现在句子末尾
    'sort-keys': 0,
    'space-before-blocks': [2, 'always'], // ---------------强制在块之前使用一致的空格
    'space-before-function-paren': [
      // --------------------要求或禁止函数圆括号之前有一个空格
      'error',
      {
        anonymous: 'always', // --------------------------针对匿名函数表达式
        named: 'always', // ------------------------------针对命名的函数表达式
        asyncArrow: 'always' // --------------------------针对异步的箭头函数表达式
      }
    ],
    'space-in-parens': [2, 'never'], // --------------------强制圆括号内没有空格
    'space-infix-ops': [
      // --------------------------------要求中缀操作符周围有空格 允许 a|0 不带空格
      'error',
      {
        int32Hint: false
      }
    ],
    'template-tag-spacing': [2, 'always'], // --------------要求或禁止在模板标记和它们的字面量之间有空格
    /********************************end 风格 相关设置********************************/

    /********************************start 变量声明 相关设置********************************/
    'init-declarations': [2, 'always'], // -----------------强制变量声明语句中初始化
    'no-delete-var': 2, // ---------------------------------禁止删除变量 (delete)
    'no-shadow-restricted-names': 2,
    'no-undef': 2, // --------------------------------------禁用未声明的变量
    'no-undef-init': 2, // ---------------------------------不允许初始化变量值为 undefined
    'no-unused-vars': [
      // ---------------------------------禁止未使用过的变量
      2,
      {
        vars: 'all', // ----------------------------------检测所有变量，包括全局环境中的变量
        args: 'none' // ----------------------------------不检查参数
      }
    ],
    'no-use-before-define': 2 // ---------------------------禁止在变量定义之前使用它们
    /********************************end 变量声明 相关设置********************************/
  }
};
